Revit 2026 API

# CityWeatherStation Property

---

An identifier for the nearest weather station

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string WeatherStation { get; }
```
```vb
Public ReadOnly Property WeatherStation As String
	Get
```
```cpp
public:
property String^ WeatherStation {
	String^ get ();
}
```
```fsharp
member WeatherStation : string with get
```

#### Property Value

String

A read only string property that contains an identifier of the nearest weather station.

#### Reference

City Class

Autodesk.Revit.DB Namespace